SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32L0180/MM32L0180_Bootloader/Device/MM32L0180/Include/reg_usart.h
/**
  * @brief USART_GTPR Register Bit Definition
  */
#define  USART_GTPR_PSC_Pos                       (0)
#define  USART_GTPR_PSC_Msk                       (0xFFU << USART_GTPR_PSC_Pos)                     /*!<Prescaler value*/
#define  USART_GTPR_PSC                           USART_GTPR_PSC_Msk
#define  USART_GTPR_PSC_0                         (0x01U << USART_GTPR_PSC_Pos) 
#define  USART_GTPR_PSC_1                         (0x02U << USART_GTPR_PSC_Pos) 
#define  USART_GTPR_PSC_2                         (0x04U << USART_GTPR_PSC_Pos) 
#define  USART_GTPR_PSC_3                         (0x08U << USART_GTPR_PSC_Pos) 
#define  USART_GTPR_PSC_4                         (0x10U << USART_GTPR_PSC_Pos) 
#define  USART_GTPR_PSC_5                         (0x20U << USART_GTPR_PSC_Pos) 
#define  USART_GTPR_PSC_6                         (0x40U << USART_GTPR_PSC_Pos) 
#define  USART_GTPR_PSC_7                         (0x80U << USART_GTPR_PSC_Pos) 
#define  USART_GTPR_GCNT_Pos                      (8)
#define  USART_GTPR_GCNT_Msk                      (0xFFU << USART_GTPR_GCNT_Pos)                    /*!<Smartcard guard time value*/
#define  USART_GTPR_GCNT                          USART_GTPR_GCNT_Msk
#define  USART_GTPR_GCNT_0                        (0x01U << USART_GTPR_GCNT_Pos) 
#define  USART_GTPR_GCNT_1                        (0x02U << USART_GTPR_GCNT_Pos) 
#define  USART_GTPR_GCNT_2                        (0x04U << USART_GTPR_GCNT_Pos) 
#define  USART_GTPR_GCNT_3                        (0x08U << USART_GTPR_GCNT_Pos) 
#define  USART_GTPR_GCNT_4                        (0x10U << USART_GTPR_GCNT_Pos) 
#define  USART_GTPR_GCNT_5                        (0x20U << USART_GTPR_GCNT_Pos) 
#define  USART_GTPR_GCNT_6                        (0x40U << USART_GTPR_GCNT_Pos) 
#define  USART_GTPR_GCNT_7                        (0x80U << USART_GTPR_GCNT_Pos) 

/**
  * @brief USART_WUADDR Register Bit Definition
  */
#define  USART_WUADDR_WAD_Pos                     (0)
#define  USART_WUADDR_WAD_Msk                     (0xFFU << USART_WUADDR_WAD_Pos)                   /*!<WakeUp ADDRess Mark bits*/
#define  USART_WUADDR_WAD                         USART_WUADDR_WAD_Msk
#define  USART_WUADDR_WAD_0                       (0x01U << USART_WUADDR_WAD_Pos) 
#define  USART_WUADDR_WAD_1                       (0x02U << USART_WUADDR_WAD_Pos) 
#define  USART_WUADDR_WAD_2                       (0x04U << USART_WUADDR_WAD_Pos) 
#define  USART_WUADDR_WAD_3                       (0x08U << USART_WUADDR_WAD_Pos) 
#define  USART_WUADDR_WAD_4                       (0x10U << USART_WUADDR_WAD_Pos) 
#define  USART_WUADDR_WAD_5                       (0x20U << USART_WUADDR_WAD_Pos) 
#define  USART_WUADDR_WAD_6                       (0x40U << USART_WUADDR_WAD_Pos) 
#define  USART_WUADDR_WAD_7                       (0x80U << USART_WUADDR_WAD_Pos) 
#define  USART_WUADDR_WADM_Pos                    (8)
#define  USART_WUADDR_WADM_Msk                    (0xFFU << USART_WUADDR_WADM_Pos)                  /*!<Wakeup address mask bits*/
#define  USART_WUADDR_WADM                        USART_WUADDR_WADM_Msk
#define  USART_WUADDR_WADM_0                      (0x01U << USART_WUADDR_WADM_Pos) 
#define  USART_WUADDR_WADM_1                      (0x02U << USART_WUADDR_WADM_Pos) 
#define  USART_WUADDR_WADM_2                      (0x04U << USART_WUADDR_WADM_Pos) 
#define  USART_WUADDR_WADM_3                      (0x08U << USART_WUADDR_WADM_Pos) 
#define  USART_WUADDR_WADM_4                      (0x10U << USART_WUADDR_WADM_Pos) 
#define  USART_WUADDR_WADM_5                      (0x20U << USART_WUADDR_WADM_Pos) 
#define  USART_WUADDR_WADM_6                      (0x40U << USART_WUADDR_WADM_Pos) 
#define  USART_WUADDR_WADM_7                      (0x80U << USART_WUADDR_WADM_Pos) 

#endif

